package org.example.DIP;

public class Car {
    // данный класс представляет автомобиль
    // в котором нет зависимости от типа двигателя
    // т.е. класс автомобиль не зависит от определенного класса двигателя
    // двигатель представляет интерфейс, при инициализации класса передается тип двигателя
    // (бензиновый или дизельный (в данном примере)) которые реализуют интерфейс "Двигатель"
    public Engine engine;

    public Car(Engine engine) {
        this.engine = engine;
    }
    public void start(){
        engine.start();
    }
}
